//Ex. 1 
let arrnum = [1, 2, 3];
alert(`Упражнение №1. Первый элемент массива: ${arrnum[0]} 
Второй элемент массива: ${arrnum[1]}
Третий элемент массива: ${arrnum[2]}`);

//Ex. 2
let arr1 = [1, 2, 3];
alert(`Упражнение №2. Первый элемент массива: ${arr1[0]} 
Второй элемент массива: ${arr1[1]}
Третий элемент массива: ${arr1[2]}`);

//Ex. 3 
let arr2 = [1, 2, 3];
let summarrelem = arr2[0] + arr2[1] + arr2[2];
alert("Упражнение №3. Сумма элементов массива: " + summarrelem);

//Ex. 4
let arr3 = ['a', 'b', 'c', 'd'];
alert("Упражнение №4. '" + arr3[0] + "+" + arr3[1] + "+" + arr3[2] + "+" + arr3[3] + "'");