const text = 5;

// Ex. 1
if (text > 10) {
    console.log("Упражнение №1. Значение переменной больше 10");
} else {
    console.log("Упражнение №1. Значение переменной меньше 10");
}

// Ex. 2
if (text < 10) {
    console.log("Упражнение №2. Значение переменной меньше 10");
} else {
    console.log("Упражнение №2. Значение переменной больше 10");
}

// Ex. 3
if (text >= 10) {
    console.log("Упражнение №3. Значение переменной больше или равно 10");
} else {
    console.log("Упражнение №3. Значение переменной меньше 10");
}

// Ex. 4
if (text <= 10) {
    console.log("Упражнение №4. Значение переменной меньше или равно 10");
} else {
    console.log("Упражнение №4. Значение переменной больше 10");
}