// Ex. 1
let test1 = '12345';
let test2 = 'abcde';

if (test1 == test2){
    console.log("Упражнение №1. Значение первой переменной, которая содержит строку, не равно значению второй переменной, которая также содержит какую-то строку");
} else {
    console.log("Упражнение №1. Значение первой переменной, которая содержит строку, равно значению второй переменной, которая также содержит какую-то строку");
}

test1 = 'hello';
test2 = 'hello';

if (test1 == test2){
    console.log("Упражнение №1. Значение первой переменной, которая содержит строку, не равно значению второй переменной, которая также содержит какую-то строку");
} else {
    console.log("Упражнение №1. Значение первой переменной, которая содержит строку, равно значению второй переменной, которая также содержит какую-то строку");
}