//Ex. 1
let r = 5;
let pi = 3.14;
let s1 = 2 * r * pi;
alert("Упражнение №1. Площадь круга с радуисом " + r + " равна: " + s1);

//Ex. 2
let a = 5;
let s2 = a ** 2;
alert("Упражнение №2. Площадь квадрата со стороной " + a + " равна " + s2);

//Ex. 3
let a1 = 15;
let b = 4;
let s3 = a1 * b;
 alert("Упражнение №3. Площадь прямоугольника со сторонами " + a1 + " и " + b + " равна " + s3);

//Ex. 4
 let a2 = 10;
 let b2 = 7;
 let p = 2 * (a2 * b2);
 alert("Упражнение №4. Периметр прямоугольника со сторонами " + a2 + " и " + b2 + " равен " + p);

 //Ex. 5
 let tc = 25;
 let res1 = tc * 1.8 + 32;
 alert("Упражнение №5. 20 градусов цельсия равняется " + res1 + " градусам по Фаренгейту");


//Ex. 6
 let tf = 90;
 let res2 = (tf - 32) / 1.8;
 alert("Упражнение №6. " + tf + " градусов по Фаренгейту равняется " + res2 + " градусам по Цельсию");