//Ex. 1
alert("Упражнение №1. Колличество секунд в сутках: " + (24 * 60 * 60) )

//Ex. 2
alert("Упражнение №2. Колличество секунд в 30 сутках: " + (30 * (24 * 60 * 60)))

//Ex. 3
alert("Упражнение №3. Колличество секунд в году: " + (365 * (24 * 60 * 60)))

//Ex. 4
alert("Упражнение №4. Колличество минут в сутках: " + (24 * 60))

//Ex. 5
alert("Упражнение №5. Колличество минут в году: " + (365 *   (24 * 60)))

//Ex. 6
alert("Упражнение №6. Колличество байт в мегабайте: " + (1 * 1024 * 1024))

//Ex. 7
alert("Упражнение №7. Колличество байт в гигайбайте: " + (1 * 1024 ** 3))

//Ex. 8
alert("Упражнение №8. Колличество байт в 10 гигабайтах: " + (10 * 1024 ** 3))

//Ex. 9
alert("Упражнение №9. Колличество байт в терабайте: " + (1 * 1024 ** 4))

//Ex. 10
alert("Упражнение №10. Колличество килобайт в терабайте: " + (1 * 1024 ** 3))