// Ex. 1
let sum1 = 0;

for (let i = 2; i <= 100; i++) {
    if(i % 2 == 0) {
        sum1 += i;
    }
}
console.log("Упражнение №1. Сумма чётных чисел от 2 до 100 равна: " + sum1);


// Ex. 2
let sum2 = 0;

for (let i = 1; i <= 99; i++) {
    if (i % 2 != 0) {
        sum2 += 1
    }
}
console.log("Упражнение №2. Сумма нечётных чисел от 1 до 99 равна: " + sum2);


// Ex. 3
let sum3 = 1;

for (let i = 1; i <= 20; i++) {
    sum3 *= i;
}
console.log("Упражнение №3. Произведение целых чисел от 1 до 20 равно: " + sum3);